# UpperRange Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ProgressChangedEventArgs..::..UpperRange Property
ProgressChangedEventArgs Class See Also
---
Upper part of progress bar range - will be any non-zero number
**Namespace:** Autodesk.Revit.DB.Events**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public int UpperRange { get; }
```

Visual Basic
---
```text
Public ReadOnly Property UpperRange As Integer
	Get
```

Visual C++
---
```text
public:
property int UpperRange {
	int get ();
}
```

# See Also
ProgressChangedEventArgs Class
Autodesk.Revit.DB.Events Namespace